import java.io.IOException;

public class runner {
    public static void main(String[] args) throws IOException {
        System.out.println(TextToGift_JE.main("Всеобщий эквивалент, выступающий измерителем стоимости товаров или услуг, легко на них обменивающийся\\\\:\n" + //
        "\n" +        
        "+деньги\n" + //
                "ценные бумаги\n" + //
                "золото\n" + //
                "иностранная валюта\n" + //
                "страховые полисы\n" + //
                "Деньги, эмитируемые Банком России, имеющие материально-вещественную форму\\\\:\n" + //
                "+наличные\n" + //
                "безналичные\n" + //
                "акции\n" + //
                "облигации\n" + //
                "векселя\n" + //
                "Деньги, представляющие собой запись о том, что физическому или юридическому лицу принадлежат финансовые ресурсы\\\\:\n" + //
                "наличные\n" + //
                "+безналичные\n" + //
                "акции\n" + //
                "облигации\n" + //
                "векселя\n" + //
                "+Процент, представляющий собой сумму дохода, начисляемого к основной сумме денежного капитала в  интервале общего периода его использования, по которой дальнейшие ее перерасчеты не осуществляются\\\\:\n" + //
                "простой\n" + //
                "+Процент, представляющий собой сумму дохода, начисляемого в каждом интервале общего периода его использования, которая не выплачивается, а присоединяется к основной сумме денежного интервала и в последующем платежном интервале сама приносит доход\\\\:\n" + //
                "+ сложный"));
    }
}
